{
  "Island Blurbs" : 
  {
    "Kala Island" : "<p>Kala Island is the base of operations for the Global Communication Setup Foundation. This island is home to the port city of Ethovalon! Ethovalon is a steampunk-ish type of city that keeps it way ahead of its time. Steam and little electricity powers the city, making it a popular tourist destination as well. Ethovalon holds many shops, a port full of ships, and a huge housing district for both residents and teams alike! The outskirts of the city is nothing more than a lush, green, field full of flowers and streams galore. A lot of the dungeons you'll come across, you won't even realize are dungeons since they're so small! Nonetheless, Kala Island is warm year round, and has nothing but positive, happy vibes!</p>",
    "Pele Island" : "<p>A rocky, craggy island to the south of Kala Island. In the center of this black hunk of earth is a giant active volcano. Luckily for what little residents reside on this island, the lava flow stays away from them. Speaking of residents, there is a massive marketplace in the city of Dutarus, at which merchants and sailors come from near and far to sell their wares.The people of Dutarus worship the volcanic deities that once lived in the volcano in ancient times. The traveling merchants Agni and Edan are said to be descendants of these deities.</p>",
    "Kumu Island" : "<p>This island is covered in thick jungles and hanging vines everywhere you look. Once you're off of the port, you're already at the mercy of the dense jungles and what awaits you inside. Because of the inhospitable island, there are no settlements, towns, or even tribes living on this island. Its treasure is yours for the taking if you can find it!</p>",
    "Slumbering Mountains" : "<p>Located in the Sea of Beginning to the east of Pele Island, these Mountains formed after much erosion and eruptions alike. The mountains are placed above an active volcanic spring, a cold ocean current, and parts of the island are ravaged by the thunderstorms. It's no understatement to call these mountains a strange place indeed.</p><p>It's said that four mirage Pokemon make this massive island their home.</p>",
    "Ash Islands" : "<p>Located in the Sea of Beginning, these islands are perpetually covered in ash raining down from the sky. The ash crosses the sea from Pele Island and lands directly on the islands, covering the trees and ground in white soot and ash. Despite the problematic ash, the townsfolk have learned to live with it. There is a port town here called Sanlow.</p>",
    "Fairy Ring Isle" : "<p>Fairy Ring Isle is the farthest island to the East, and the last island in the Sea of Beginning. This island has a peculiar shape, forming a lake in the center of the island. Mystical forests surround this lake with smaller lakes in said forests. There's no towns or cities here which makes this island's mystical quality even greater!</p>",
    "Isle of Steam" : "<p>A technologically advanced island to the east of Ash Islands. This place is powered by steam and is way more advanced than plenty of islands in the vast sea. Trams, trains, and trolleys get you from place to place on the island, and even the dungeons here are quite technological, just like the island itself! Allurian is the capital city of the island. Not only does most of the steam power come from Allurian, but the buildings are made out of brass as well!</p><p>The folk here are very friendly, and will gladly give tours of their grand home!</p>",
    "Draconian Peaks" : "<p>While there are no cities to this grand mountainous island, there are plenty of dungeons to explore here! There are ruined colosseums and crags just waiting to be explored! The snow-covered tops create a harsh environment, and the steep slopes make getting up there even more treacherous. If you can pinpoint the dungeons, you're in for a world of treasure and amazement!</p>",
    "Serene Island" : "<p>An island far to the east in the Sea of Beginning. While there are no towns or barely any dungeons that make this tiny island home, the sunny skies and the white beaches make it a lovely place to relax for a little while. Perhaps instead of exploring the island, you could take a load off and relax for a bit?</p><p>No? Well, exploring it is …</p>",
    "Frozen Isle" : "<p>Freezing? Well you will be once you step foot on this island! Close to the Snow Continent, this island is perpetually covered in a thick layer of snow. It's always snowing, hailing, or sleeting, so bring something to bundle up in! There are several dungeons scattered throughout this icy landscape just waiting to be explored! Just make sure you're warm enough!</p>",
    "Sea of Beginning" : "<p>While out at sea, there's bound to be some dungeons you see while sailing about! Take a good look around in the sky, the ocean, all around! You never know what might be waiting just out of reach! Be sure you bring along plenty of HMs with you!</p>",
    "Spiral Archipelago" : "<p>An archipelago that comprises several islands in a spiral pattern if looked at from an aerial view. Many fishermen and sailors come from this area of the sea looking for adventure or the sea's bounty. Many fishing towns and quaint cities line the shores of the islands. Other islands are forbidden to the residents of the occupied islands as dangerous mystery dungeons make up the other islands. Between nasty waterspouts often appearing towards the center of the archipelago and tsunamis wracking the northern islands, it's quite a different setting from the southern and eastern region. Inhabitants from Skull Island often send brigands to the western shores to plunder the villages there.</p>",
    "Skull Island" : "<p>An Island that resembles the skull of an unknown creature. The place absolutely reeks of rotting flesh and dirt. They say that those who wash ashore are sailors that lost their way during harsh storms. This island seems inhabitable. Yet glowing eyes can be seen sparkling in the rotting woods. Dare you venture forward, or turn back while you can?</p>",
    "Desert Region" : "<p>On the western side of the region, a dry savannah where plenty of Pokemon thrive and to the east, a harsh desert where only the strongest survive. Wherever you decide to explore, best keep on your toes, and always remember to bring some water with you. It's very hot and very dry in the Desert Region.</p>",
    "Lanier Islands" : "<p>A once thriving, proud and wealthy area ripped down within the past couple decades by drought, disease, and financial ruin. It includes the small, closely grouped islands including Rockdale, Bartow, and Pierce. Towns are small and run down with bars across their windows and locked doors. Dust storms regularly ravage the land's already ruined soil, sometimes uncovering remnants of crops and cattle long gone. A mysterious force has been slowly spreading over the island for years now, turning areas once normal into dungeons, leaving behind remnants of what once was built.People hoard what little they have and are not keen on giving it away to strangers. These islands have become a rotting nest of thieves, pirates, outlaws, and cutthroats. The law is far and few between and even then it exists to serve itself. Attempting to make an honest living here is near impossible and well-meaning folk do not last long on the islands' worn down streets these days.</p><p>Guard your wallet and your trust closely.</p><p>Or better yet, don't visit.</p>",
    "Disadattato Island" : "<p>This Island has three compartments. It is a bit odd but it fits the name at least! You may find that this island in particular has several completely different pokemon and towns-- like a misfit. Some areas are friendlier to be in rather than some-- The island also has rapid weather changes and auras. Some rumors that even legendary pokemon roam about here, changing the terrain. It seems upon first arriving you're greeted by a Sableye with tropical attire. He gives you a pamphlet and says this is the perfect place for retiring! (Especially since one part of the island dead people supposedly come back to life!)</p>",
    "Islands of the Colossus" : "<p>Sailing northeast of Kumu Island, you noticed almost three islands, mostly burdened with vegetation and didn't really look quite inhabitable. These islands resemble more of a cavern-like system, as if the inhabitants must have lived underground. It almost seems like nobody wanted to be there... An ominous feeling emanates from this place.</p>",
    "Parella Island" : "<p>Parella Island was once a tropical getaway and a lovely place to be at peace with the whole family. Beautiful shores, beautiful landscapes, and plenty of flowers growing everywhere. After a terrible storm ravaged the island, it was deemed unsafe to continue its business. As such, nature was able to retake the island for itself.</p>",
    "The Hissing Isle" : "<p>This jagged island is a mysterious one with goblins, imps, fairies alike! Maybe a unicorn or two! This island is home to a mythical pokemon of legend which emerges from the colorful pond. The pond has magical qualities, seeming to disappear and reappear in different locations and is hard to keep track of on the jungle-like island. It will always have a cave with moonstones surrounding it.</p><p>However, the locals know this is all total baloney, and their pond is just broken.</p>",
    "Autumnal Heights" : "<p>Far to the northeast of the Desolate Sea is a giant island full of maple trees of orange, red, and yellow hues. The mountains that line the area are covered in trees changing color. Although the sea the island is home to is relatively warm, there seems to be a chill in the air. The air smells of decaying leaves, the wind blows with a slight chill, and yet the sun remains warm. It would seem this island is perpetually stuck in the autumn season.There doesn't seem to be any towns in the surrounding areas, but there is a big sign at the established docks that point to nature trails surrounding the dungeons!</p>",
    "The Ancient Tundra" : "<p>An island known for its dislike of outsiders and icy winters. This Island is famous for the various Vikings and Warriors it seems to produce. Entering this Island, you're immediately greeted with cold temperatures and beautiful ice sculptures. Despite the beautiful scenery, something tells you that if you stay too long, you're sure to find yourself in battle.</p>",
    "Sweetful Isle" : "<p>Sailing towards unseen land, you start to feel hungry. Something in the air compelled you to sail to the port where you are greeted with a small market town named Hershey. It is a small town, however, the market is booming with travelers who have come to try the delectable goodness of the food found on this island.</p>",
    "Snow Continent" : "<p>One of the large continents to the east and the first of which the foundation had managed to unveil. Before you even reach the mainland of this continent, thick snow falls everywhere surrounding the land. There are two port cities that can be found here, each a wonderful and inviting place for travelers to rest their weary heads. While blizzards do oftentimes plague this area of the world, it doesn't bother the locals all that much. It's said sometimes that the snow that falls in this area resembles crystals. and glitter.</p>",
    "Frozen Wasteland" : "<p>The Frozen Wastelands are four islands, Fuzzy Tundra makes the largest while the smaller three are much smaller and contain pokemon of different typings that have adapted to the cold temperatures on the islands. It is pretty hard to adapt to the extreme cold temperatures here, so not a lot of things are built down here due to the harsh weather. However, there is one little town on the Fuzzy Tundra called Igloo. It's a small settlement with an everlasting campfire powered by thousands of fire stones.</p>",
    "Othrys" : "<p>Far to the south at the edge of the world, through snow, hail and ice, is an oasis of warmth.</p><p>Hot steam rises from the ground, clogging the air surrounding this island with a deep fog. It is a wild place, untamed with no standing towns and shifting sheets of ice, forming and melting away as quickly as they come. That is not to say there is not life on Orthys but rarely is it life there with much other choice of residence. For the exiled, the deserters, traitors, and hermits, the island's currents pull in the lost and its deep fog and gentle promises of anonymity beckon them to stay.</p><p>If you are lost, if you are looking for something, or even someone - you may have come to the right place.</p>",
    "Grass Continent" : "<p>The second continent to the northeast that the GCSF reconnected with!</p><p>As one can guess, the Grass Continent is absolutely massive, and despite the name it was given, there are all kinds of vast terrain that cover the continent. From plains to forests and caves, and even scorching hot deserts.</p><p>There's definitely a lot to see and do here!</p>",
    "Air Continent" : "<p>The Air Continent is a vast landscape of many different dungeons and terrain to behold! Just like the Grass Continent, there are several well-known landmarks and settlements here!</p>",
    "Mist Continent" : "<p>The Mist Continent is a large stretch of land that forms high into the north where large amounts of mist and snow encase the area!</p>",
    "Water Continent" : "<p>The Water Continent is home to sprawling fields full of rivers, lakes, ponds, and magnificent beaches!</p>",
    "Sand Continent" : "<p>Aside from Sahra Town, there's nothing but wilderness in the Sand Continent. Speaking of which …</p><p>All dungeons on the Sand Continent are high tier dungeons. Only those truly seeking the thrill should test their strength here! Don't overdo yourself, but don't let your worries hold you back. Go forth and explore the dungeons buried in time!!</p>",
    "Sea of Wonders" : "<p>The edges of the map are filling in quickly and the Sea of Wonders is one of the last great hurdles!</p><p>Who knows what kind of adventures await you and your teams in this section of the ocean? Much like the Sand Continent, this area is the true test of strength for exploration teams! There are some dungeons that seem like tropical getaways, all the way to the most difficult of dungeons laid before you! All your training and exploration has led to this moment!</p><p>Go forth with courage!!</p>",
    "Cloud Breach" : "<p>After breaking through a mirage-like cloud barrier, you are greeted by the sight of an archipelago of small, floating islands. Under many of those islands is an ocean in the sky – perhaps that explains some of the areas on the surface that always seem to rain, no matter what season. Looking closely, there are even island-like reef structures within the deceptively shallow sky's ocean.</p><p>In the distance, you can spot glimpses of other islands through more cloud walls… something about them, however, feels off. Ancient, undisturbed, and even from this distance… you know now you tread on unsafe ground.</p><p>The archipelago dubbed "Cloud Breach" is deceptively idyllic and might lull you into a false sense of security! Nonetheless, it is here Mary established your base of operations in the sky.</p>",
    "Behemoth Isles" : "<p>A country that spans over a few islands that float within the clouds. Each island seems to hold a different climate to accommodate to those who live within. From Dense, decaying forests to Mountains covered in snow. These Isles are both just as interesting as they are dangerous! Despite the terrain's threats…at least the locals are known to be friendly. Maybe too friendly.</p>",
    "The Starry Cascada Islands" : "<p>Flying to these islands was a trip in and of itself. Upon breaching the isles, what appears to be a night sky envelops the ships. It may look to be a relief but, the view up ahead would take the breath out of anyone's lungs. Small, mountainous, floating islands were scattered everywhere. Little bits of foliage were bathed in the colors of fleeting twilight. It sure was windy for an archipelago, though, but the iridescent lenticular clouds may help explain things!</p><p>However, all of this dulled in comparison to the main islands. Glowing, vanilla twilight waterfalls cascaded down furiously. The cascades were pouring into streams and, inevitably,  the anvil head of a massive cumulonimbus cloud below. The biggest of the islands holds what appears to be a prosperous city within a confluence. A dock at its most southward point seems to be where the stop is!</p>",
    "The Glimmering Isle" : "<p>Even through the thick layers of clouds, one can occasionally get a glint from something shimmering in the sun. As the clouds part, a breathtaking island manifests - huge crystals protrude from its underside and even among the mass of deep foliage that covers the majority of the island. Speaking of the thick forest, the hues are far from the typical green seen in most other places. The majority of the foliage appears to be hues of purple, though pink, yellow, blue and green can be seen around. There's just something beautiful yet mysterious about the forests, as if one could get lost in them.</p><p>After docking in Three Lagoons Bay, the southern portion of the island seems easiest to access, which allows for a closer inspection of the island at large. The forest is thick, and the trees are tall and strong. There are areas that the sun doesn't seem to penetrate through to the ground often. Mushrooms and flowers dot the trails, and a variety of interesting plants seem to make their homes here. Some even glow, giving off light in areas that wouldn't have much, if any. Atop all of that, it's noticeable just how much of the island make-up is crystals. Some crystals are overgrown and others stick out of trees. Strangely, some trees even seem to be crystal themselves… or encased in crystal. There are trees with crystal growths, and twinkling leaves.</p><p>Amongst all of this, though, can be found ruins. Some are simple, but others are intricate, and suggest a great culture once lived on this island. An eerie feeling creeps in - what happened to this place?</p>",
    "The Land of Mists" : "<p>This island comprises one major island with several archipelago-like offshoots. Large green mountains touch the sky as fog and clouds swirl at their peaks. Dense forests cover most of the land, and waterfalls cascade water to the world below. Villages are hidden within the foliage and if discovered are beyond imaginable!</p><p>Its very image is ethereal -- the very essence of beauty!</p>",
    "The Lost Kingdom" : "<p>The airship brings you into view of a massive island; the trees twist and wind so tightly that, from afar, one might think there's no land to tread. Upon landing on a sheer cliff, however, you discover a small break in the thicket, allowing you passage onto the island.</p><p>Thorns reach out at you from every angle, and you must walk with care not to tumble upon the roots and into the trees' maws. Silence, unwelcoming and cold, replaces the faint whispers of the leaves – this place, you know, reeks of death and destruction. All senses but sight could tell you as much, and yet, you continue forward.</p><p>If not for the small village that greets you, it would appear that this island is all but abandoned. The only remaining denizens are a small colony of Charcadet – all forgotten to the world that they, too, have forgotten since the quiet took hold.</p>"
  }
}